// pages/subscriber/subscriber.js
let str = `
<div  style = "width:100%; margin:10px 0; font-size:33rpx; line-height:33rpx; color:#666">
<h1  style="text-align:center;">使用协议 </h1>
<p>  </p>
<h3 >1.&nbsp;使用条款的接受 </h3>
<p >请您在使用本网站前仔细阅读以下各项使用条款（以下简称&quot;条款&quot;）。通过访问和/或使用本网站，您表示同意接受本条款的所有条件和条款。如果您不愿接受本条款的全部条件和条款，请您不要访问或使用本网站。 </p>
<h3 >2.&nbsp;变更和修改 </h3>
<p >中仕学社有权随时对本条款进行修改，并且一旦发生条款的变动，中仕学社将在相关页面上提示修改的内容；用户如果不同意本条款的修改，可以放弃使用或访问本网站或取消已经获得的服务；如果用户选择在本条款变更后继续访问或使用本网站，则视为用户已经接受本条款的修改。 </p>
<h3 >3.&nbsp;服务说明 </h3>
<p >中仕学社运用自己的系统通过互联网向用户提供服务，除非中仕学社另有明确规定或同用户书面达成新的协议，增强或强化目前服务的任何新功能，包括新产品以及新增加的服务，均无条件地适用本条款。 </p>
<p >中仕学社不保证服务一定会满足用户的使用要求，也不保证服务不会被中断，对服务的及时性、安全性、准确性也不作担保。 </p>
<h3 >4.&nbsp;用户行为 </h3>
<p >用户注册成功后，便成为中仕学社的合法用户，会得到一个密码和帐号。用户需采取合理措施维护其密码和帐号的安全。用户对利用该密码和帐号所进行的一切活动负全部责任；由该等活动所导致的任何损失或损害由用户承担，中仕学社不承担任何责任。 </p>
<p >用户同意遵守《中华人民共和国保守国家秘密法》、《中华人民共和国著作权法》、&nbsp;《互联网电子公告服务管理规定》、《信息网络传播权保护条例》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》等有关的法律、法规以及政府部门的规定。在任何情况下，中仕学社如果认为用户的行为可能违反上述法律、法规，中仕学社可以在任何时候，有权不经事先通知终止向该用户提供服务。 </p>
<p >中仕学社欢迎用户举报任何违反上述法律或侵犯他人权利的上传内容，一经发现违法或侵权的上传内容，中仕学社将根据相关的法律规定进行删除。 </p>
<p >禁止用户从事以下行为： </p>
<p >&#8226;&nbsp;上载、张贴、发送电子邮件或传送包含任何反对宪法所确定的基本原则、危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一、破坏民族团结、损害&nbsp;国家荣誉和利益、煽动民族仇恨、民族歧视、破坏民族团结、破坏国家宗教政策、宣扬邪教和封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪、侮辱&nbsp;或者诽谤他人，侵害他人合法权益的等法律、行政法规禁止的内容或其他另人反感的包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料&nbsp;（以下简称内容）。 </p>
<p >&#8226;&nbsp;以任何方式危害未成年人。 </p>
<p >&#8226;&nbsp;冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关。 </p>
<p >&#8226;&nbsp;伪造标题或以其他方式操控识别资料，使人误认为该内容为中仕学社所传送。 </p>
<p >&#8226;&nbsp;将广告函件、促销资料、&quot;垃圾邮件&quot;等，加以上载、张贴、发送电子邮件或以其他方式传送。供前述目的使用的专用区域除外。 </p>
<p >&#8226;&nbsp;将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送。 </p>
<p >&#8226;&nbsp;干扰或破坏本网站服务或与本网站服务相连的服务器和网络，或不遵守本网站使用之规定。 </p>
<p >&#8226;&nbsp;故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范。 </p>
<p >用户应当对其提供的经由本网站上载、张贴、发送电子邮件或传送的内容承担全部责任，对于用户经由本网站而传送的内容，中仕学社不保证前述其合法性、正当性、准确性、完整性或品质。用户在接受本网站服务时，有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，中仕学社均不对任何内容承担任何责任，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。中仕学社有权（但无义务）自行拒绝或删除经由本网站提供的任何内容。用户使用上述内容，应自行承担风险。中仕学社有权利在下述情况下，对内容进行保存或披露： </p>
<p >&#8226;&nbsp;法律程序所规定； </p>
<p >&#8226;&nbsp;本用户协议条款规定； </p>
<p >&#8226;&nbsp;其他中仕学社认为有必要的情况。 </p>
<p >中仕学社不对用户所发布信息的删除或储存失败承担责任。中仕学社有权判断用户的行为是否符合本网站使用条款之规定，如果中仕学社认为用户违反了法律规定或者违背了本用户协议的规定，中仕学社有终止向其提供网站服务的权利。 </p>
<h3 >5.&nbsp;用户隐私权制度 </h3>
<p >当用户注册中仕学社的服务时，用户应当提供个人信息。中仕学社收集个人信息的目的是为用户提供尽可能多的个人化网上服务。中仕学社不会在未经合法用户授权时，公开、编辑或透露其个人信息及保存在中仕学社中的非公开内容，除非有下列情况： </p>
<p >&#8226;&nbsp;法律程序所规定； </p>
<p >&#8226;&nbsp;本用户协议条款规定； </p>
<p >&#8226;&nbsp;其他中仕学社认为有必要的情况。 </p>
<h3 >6.&nbsp;关于第三方链接 </h3>
<p >本网站服务可能会提供与其他国际互联网网站或资源进行链接。对于前述网站或资源是否可以利用，中仕学社不承担担保责任。因用户使用上述网站或资源所产生的损失或损害，中仕学社也不负担任何责任。 </p>
<h3 >7.&nbsp;免责声明 </h3>
<p >中仕学社对于任何自本网站而获得的他人的信息、内容或者广告宣传等任何资讯（以下统称&#8220;信息&#8221;），不保证真实、准确和完整性。如果任何单位或者个人&nbsp;通过上述&#8220;信息&#8221;而进行任何行为，须自行甄别真伪和谨慎预防风险，否则，无论何种原因，本网站不对任何非与本网站直接发生的交易和/或行为承担任何直接、&nbsp;间接、附带或衍生的损失和责任。 </p>
<p >中仕学社有权但无义务，改善或更正本网站任何部分之任何疏漏、错误。 </p>
<p >中仕学社不保证（包括但不限于）： </p>
<p >&#8226;&nbsp;本网站适合用户的使用要求； </p>
<p >&#8226;&nbsp;本网站不受干扰，及时、安全、可靠或不出现错误； </p>
<p >&#8226;&nbsp;用户经由本网站取得的任何产品、服务或其他材料符合用户的期望。 </p>
<p >用户使用经由本网站收听的下载的或取得的任何资料，其风险自行负担；因该等使用导致用户电脑系统损坏或资料流失，用户应负完全责任； </p>
<p >基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，中仕学社不承担任何直接、间接、附带、衍生或惩罚性的赔偿： </p>
<p >&#8226;&nbsp;本网站使用或无法使用； </p>
<p >&#8226;&nbsp;经由本网站购买或取得的任何产品、资料或服务； </p>
<p >&#8226;&nbsp;用户资料遭到未授权的使用或修改； </p>
<p >&#8226;&nbsp;其他与本网站相关的事宜。 </p>
<p >用户在浏览互联网时自行判断使用本网站的搜索或检索目录。该搜索或检索目录可能会引导用户进入到被认为具有攻击性或不适当的网站，中仕学社没有义务查看检索目录所列网站的内容，因此，对其正确性、合法性、正当性不负任何责任。 </p>
<h3 >8.&nbsp;第三方责任 </h3>
<p >由于用户经由本网站上传或发布内容、与本网站连线、违反本服务条款或侵害其他人的任何权利应当由用户负责，中仕学社对此不承担任何责任。中仕学社禁止任何人以任何形式上传侵犯他人版权的资料（包括但不限于视频、音频、文章、电子书）如因上述原因导致任何第三人向中仕学社提出权利主张的，由上传者全权承担，并且同意赔偿中仕学社及其分公司、关联公司、代理人或其他合作伙伴及员工的全部直接、间接损失。 </p>
<h3 >9.&nbsp;终止 </h3>
<p >无论是否有原因，用户或是中仕学社都有权在任何时间终止这些条件。一旦中仕学社终止了这些条款，中仕学社将按照你在注册时提供的电子邮件地址发出通知，用户将被视为在一个小时内收到了通知。终止将于该时间生效。用户有责任向中仕学社通知有关用户的电子邮件地址的任何改变。当终止生效时，用户须销毁从本网站所获得的所有资料和信息以及其复制件。 </p>
<h3 >10.&nbsp;法律的适用和管辖 </h3>
<p >本使用条款的生效、履行、解释及争议的解决均适用中华人民共和国法律，与本条款有关的争议提交由中仕学社服务器所在地的法院管辖。本服务条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力。 </p>
<p >&nbsp;</p>
</div>
`
Page({

  /**
   * 页面的初始数据
   */
  data: {
    content:str
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})